Repository: Ibrokhimjon8572/ecommerce-bot
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ru, uz

source: back
ru: 🔙 Назад
uz: 🔙 Orqaga

source: unknown
ru: Ошибка
uz: Xatolik

source: send location
ru: Отправьте 📍 геолокацию
uz: 📍 Geolakatsiya jo'nating

source: enter address name
ru: Введите название адреса
uz: Manzil nomini kiriting

source: basket
ru: 🗑 Корзина
uz: 🗑 Savatcha

source: added to basket
ru: 🧺 Добавлено в корзину
uz: 🧺 Savatchaga qo'shildi

source: invalid number
ru: Неправильное количество
uz: Miqdor xato kiritildi

source: %(description)s Price: %(price)d
ru: %(description)s Цена %(price)d сум
uz: %(description)s Narxi: %(price)d so'm

source: choose
ru: Введите количество
uz: Miqdorni kiriting

source: invalid_phone
ru: Неправильный номер телефона
uz: Telefon nomeri xato

source: hello_message
ru: Привет. Отправьте номер телефона
uz: Assalomu alaykum. Telefon nomeringizni jo'nating

source: basked cleared
ru: Корзина очищена
uz: Savatcha tozalandi

source: empty basket
ru: Ваша корзина пусто
uz: Savatcha bo'sh

source: main_menu
ru: Меню
uz: Menyu

source: categories
ru: Категории
uz: Bo'limlar

source: cash
ru: Наличные
uz: Naqd pul

source: terminal
ru: Терминал

source: ask payment
ru: Выберите способ оплаты
uz: To'lov turini tanlang

source: yes
ru: Да ✅
uz: Ha ✅

source: order_accepted
ru: Заказ отправлен администраторам
uz: Buyurtma administratorlarga jo'natildi

source: no
ru: Нет ❌
uz: Yo'q ❌

source: address %(address)s
ru: <b>Адрес:</b> %(address)s
uz: <b>Manzil:</b> %(address)s

source: payment_type: %(payment_type)s
ru: <b>Способ оплаты:</b> %(payment_type)s
uz: <b>To'lov turi:</b> %(payment_type)s

source: comment %(comment)s
ru: <b>Комментарий к заказу:</b> %(comment)s
uz: <b>Izoh:</b> %(comment)s

source: confirm order
ru: Подтвердить заказ?
uz: Buyurtmani tasdiqlaysizmi?

source: confirmed
ru: Ваш заказ принят
uz: Buyurtmangiz tasdiqlandi

source: order title
ru: Ваш заказ

source: description
ru: Ваша общая покупка

source: cancelled
ru: Ваш заказ отменен
uz: Buyurtmangiz bekor qilindi

source: orders
ru: Заказать
uz: Buyurtma berish

source: settings
ru: ⚙️ Настройки
uz: ⚙️ Sozlamalar

source: skip
ru: Продолжить без геолокации
uz: Geolokatsiyasiz davom etish

source: my addresses
ru: Мои адреса
uz: Mening manzillarim

source: payment success
ru: Оплата прошла успешно

source: add new address
ru: Добавить новый адрес
uz: Yangi manzil kiritish

source: select address
ru: Выберите адрес доставки
uz: Yetkazib berish manzilini tanlang

source: uz
ru: 🇺🇿 O'zbekcha
uz: 🇺🇿 O'zbekcha

source: ru
ru: 🇷🇺 Русский
uz: 🇷🇺 Русский

source: ready
ru: Готово ✅
uz: Tayyor ✅

source: choose_language
ru: Выберите язык
uz: Tilni tanlang

source: send comment
ru: Отправьте комментарий к заказу
uz: Buyurtmangizga izoh yozing

source: change_language
ru: Изменить язык
uz: Tilni o'zgartirish

source: change_phone
ru: 📞 Изменить номер телефона
uz: 📞 Telefon nomerni o'zgartirish

source: choose_action
ru: Выберите действие
uz: Amalni tanlang

source: send_phone_text
ru: 📞 Отправить номер телефона
uz: 📞 Telefon nomerni jo'natish

source: add to basket
ru: 🧺 Добавить в корзину
uz: 🧺 Savatchaga qo'shish

source: order
ru: Заказать
uz: Buyurtma berish

source: clear basket
ru: Очистить корзину
uz: Savatchani tozalash

source: delete %(name)s
ru: ❌ %(name)s
uz: ❌ %(name)s

source: location
ru: Отправить 📍 геолокацию
uz: 📍 Geolakatsiya jo'natish

source: %(name)s ✖️ %(amount)s: %(price)s
ru: %(amount)s ✖️ %(name)s: %(price)s сум
uz: %(amount)s ✖️ %(name)s: %(price)s so'm

source: total: %(price)s so'm
ru: <b>Сумма:</b> %(price)s сум
uz: <b>Jami:</b> %(price)s so'm
